/*****************************************************************************
模块名      : 迭代器模式（Iterator Pattern）
文件名      : 
相关文件    : 
文件实现功能: 
应用场景	：1、访问一个聚合对象的内容而无须暴露它的内部表示。 
              2、需要为聚合对象提供多种遍历方式。 
			  3、为遍历不同的聚合结构提供一个统一的接口。 
作者        : Herman
版本        : V1.0  Copyright(C) 2018- GAM, All rights reserved.
-----------------------------------------------------------------------------
修改记录:
日  期      版本        修改人      修改内容
2018/07/05  1.0         Herman         新建
******************************************************************************/

#include <iostream>

int main(int argc, char* argv[])
{

	char a;
	a = getchar();
}